Tekla.Structures.AnalysisInternal.DotAnalysisSubSection
Serialization structure for AnalysisSubSection.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._AnalysisObject
Analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._Type
Type of sub section.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._SubType
Subtype of sub section.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._MaterialID
Material identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._OffsetY
Offset Y.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._OffsetZ
Offset Z.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._OffsetAngle
Offset Angle.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._B
B.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._B1
B1.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._B2
B2.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._B3
B3.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._B4
B4.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._H
H.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._H1
H1.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._H2
H2.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._R1
R1.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._R2
R2.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._T1
T1.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._T2
T2.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._T3
T3.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._T4
T4.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._TW
TW.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._TF
TF.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection._IsHole
Is hole.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection.ToStruct(Tekla.Structures.Analysis.AnalysisSubSection,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For private usage only!
P: P.
dotPoints: The points.

Tekla.Structures.AnalysisInternal.DotAnalysisSubSection.FromStruct(Tekla.Structures.Analysis.AnalysisSubSection,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
DO NOT USE! For private usage only!
P: P.
dotPoints: The points.